from pyrogram import Client, filters
from pyrogram.types import Message
import random
import time

# api id , api hash, bot_token
api_id: int = 27866094
api_hash: str = "b7a7ebdb70d10917a028b033c999e77d"
bot_token: str = "7066676369:AAGt9df7Ak5YOTII4Zm0pC0R4rK7L7WkSO8"

# ايدي المطور
dev_id: int = 6934572688

# تعريف قائمة الأذكار
azkar = [
    '﴿ يَعْلَمُونَ ظَاهِرًا مِنَ الْحَيَاةِ الدُّنْيَا وَهُمْ عَنِ الْآخِرَةِ هُمْ غَافِلُونَ ﴾','﴿انْظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۚ وَلَلْآخِرَةُ أَكْبَرُ دَرَجَاتٍ وَأَكْبَرُ تَفْضِيلًا ﴾',
    '﴿ وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ ﴾','﴿ أَلَّا تَخَافُوا وَلَا تَحْزَنُوا وَأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنتُمْ تُوعَدُونَ ﴾.','﴿ وَإِنِّي لَغَفَّارٌ لِّمَن تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَى ﴾.',
    '﴿ أَلَا لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ ﴾',
    '''- اللهم أنت المُيسِّر وأنت المسهل 
سَهِّل أمري وحقق مطلبي، 
اللهم لا تبتليني في نفسي ولا بمن 
أحب بُعدًا ولا فَقدًا ولا حزنًا ولا مرضًا، 
اللهم إني أعوذ بك من عينٍ تصيب 
القلب فتُحزنة، والرزق فتنقصه، 
والبال فتتعبه، والنجاح فتفشله، 
اللهم أَخرجني من أشد الضيق إلى
أوسع الفرج.''',
    'اللهُ الذي يرعى نملةً في جحرٍ مظلمٍ، ويرزقها ويحميها أتظنهُ ينساك.',
    '‏﴿سَيَجعَلُ اللَّهُ بَعدَ عُسرٍ يُسرًا﴾.',
    '﴿لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ﴾',
    '﴿فَاصْبِرْ صَبْرًا جَمِيلًا﴾',
    '﴿ إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ ﴾',
    '﴿ وَلَقَدْ نَعْلَم أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ فَسَبِّحْ بِحَمدِ رَبِّكَ وَكُن مِّنَ السَّاجِدِينَ ﴾',
    '﴿وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ﴾',
    '﴿لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا﴾',
    '﴿وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا﴾',
    '‏﴿ وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ ﴾',
    'ولا تقبضني إلا تائبًا مقبولًا مرضيًا عني يا الله',
    '﴿وَعَلَى اللَّهِ فَليَتَوَكَّلِ المُتَوَكِّلونَ﴾',
    '‏﴿وَرَحمَتي وَسِعَت كُلَّ شَيء﴾',
    '﴿أَلَّا تَخَافُوا وَلَا تَحْزَنُوا وَأَبْشِرُوا﴾‏',
    '﴿إِنَّكَ سَمِيعُ الدُّعَاءِ﴾',
    '﴿‏تَرَاهُمْ رُكَّعًا سُجَّدًا﴾',
    '‏﴿إِنَّا نُبَشِّرُكَ﴾',
    '﴿ ‏قُلْ لَنْ يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ﴾',
    'ياربّ إني توكلت عليك ، وأنت أدرىٰ .',
    '﴿وَيَفْعَلُ اللَّهُ مَا يَشَاء﴾',
    '''_ وإذا تعلّقت القلوبُ بِربِّها 
طابت لهَا الدنيا بِرغم أساهَا
قل للأمانِي السائراتِ لِربهّا
اللَّه يسمعهَا " ولا ينْساهَا " 🤍.''',
    '‏يارب لا تعطيني على قدر تعبي، اعطيني على قدر كرمك.','﴿ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظَامًا فَكَسَوْنَا الْعِظَامَ لَحْمًا ثُمَّ أَنْشَأْنَاهُ خَلْقًا آخَرَ ۚ فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ ﴾',            '﴿وَلَقَدْ خَلَقْنَا الْإِنْسَانَ مِنْ سُلَالَةٍ مِنْ طِينٍ﴾',
    '﴿ ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَكِينٍ ﴾',
    '﴿ الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ هُمْ فِيهَا خَالِدُونَ ﴾',
    '﴿أُولَٰئِكَ هُمُ الْوَارِثُونَ﴾',
    '﴿وَالَّذِينَ هُمْ عَلَىٰ صَلَوَاتِهِمْ يُحَافِظُونَ﴾',
    '﴿فَمَنِ ابْتَغَىٰ وَرَاءَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْعَادُونَ﴾','''-تذكير 
-الحمدُلله .
 -سُبحان الله.
 -لا إله إلا الله.
 -أستغفِر الله.
 -بسم الله.
 -الله اكبر .
-اللهم صلِ وسلم على نبينا محمد.''','''‏﴿فَبَشَّرْنَاهُ﴾ ، ﴿وَبَشَّرْنَاهُ﴾ ، ﴿فَبَشَّرْنَاهَا﴾ ،
﴿لَهُمُ الْبُشْرَىٰ﴾ ﴿وَجَاءَتْهُ الْبُشْرَىٰ﴾

"اللهم نَسألك بُشرى تطرُق المَسامِع، وأفراحًا 
تهطل لها المدامع، اللهم ربّ البشائر، بُشرىٰ."''',
    '"ربِّ أنتَ أعلم بالقلبِ وما يعي، والنّفس وما ترغب، والرُوح وما تأمل، بحبلِك الوثيق أتمسّك، وعلى جدارِ رحمتك أتكئ، أسألُك النجاةَ من وجعٍ تغلغل القلبَ واستوطنه، وشعورٍ أثقل الرُوح فاستعصىٰ عليهَا المسير،     هذا السؤال وعندكَ الإجابة، وإليك فوّضتُ الأمرَ كُله، فلا تكلّني لِسواك!."',
    '"اللهُمّ صلِّ وسلّم علىٰ سيّدنا مُحمّد."',
    '- ‏أكثروا من الصلاة على النبي فإنها تكفي همك وتغفر ذنبك ﷺ.'
]

# تعريف البوت
bot = Client(
    "azkar-bot",
     api_id=api_id,
     api_hash=api_hash,
     bot_token=bot_token)


# دالة الأمر "تشغيل"
@bot.on_message(filters.command("تفعيل"))
def start_sending_azkar(client: Client, message: Message):
    if message.from_user.id == dev_id:
        while True:
            random_azkar = random.choice(azkar)
            client.send_message(message.chat.id, f"`{random_azkar}`")
            time.sleep(3600)  # إرسال الأذكار كل ساعه


# تشغيل البوت
bot.run()
